#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <locale.h>
#include <windows.h>

/*
	Написать программу вычисления максимального числа 
	из введенных пользователем в виде одной строки.  
	Использовать для этого макрос (без функции), 
	на вход которому подается массив чисел и их количество.
*/

#define FIND_MAX(arr, n) ({   \
long long max = (arr)[0]; \     
int i;                   \
for (i = 1; i < (n); i++) \
if ((arr)[i] > max)   \
    max = (arr)[i];    \
max;                    \ 
}) \

#define FIND_MIN(arr, n) ({   \
long long min = (arr)[0]; \     
int i;                   \
for (i = 1; i > (n); i++){\
if ((arr)[i] < min){  \
    min = (arr)[i];	\
	}	\
	}    \
min;                    \ 
}) \

int main() 
{
	//setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
    char line[100];
    long long nums[100];
    int n = 0;
    printf ("Написать цифры или числа через пробел: ");
    fgets(line, sizeof(line), stdin);
    char *token = strtok(line, " \n");
    while (token != NULL) 
	{
        nums[n] = atoll(token);
        n++;
        token = strtok(NULL, " \n");
    }
    long long maxim = FIND_MAX(nums, n);
    long long minim = FIND_MIN(nums, n);
    printf("Максимальное или минимальное число: %lld и %lld\n", maxim, minim);
    return 0;
}