#include <stdio.h>
#include <stdlib.h>

/* 
	Дано натуральное число N. 
	Выведите все его цифры по одной, 
	в обычном порядке (а потом в обратном), 
	разделяя их пробелами или новыми строками. 
	Например: 179 => 1 7 9; 179 => 9 7 1
	При решении этой задачи нельзя использовать строки, 
	списки, массивы (ну и циклы, разумеется).
*/

void print_forward(int n) 
{
    if (n < 2) 
	{
        printf("%d ", n);
        return;
    }
    print_forward(n / 10);
    printf("%d ", n % 10);
}

void print_backward(int n) 
{
    if (n < 2) 
	{
        printf("%d ", n);
        return;
    }
    printf("%d ", n % 10);
    print_backward(n / 10);
}

int main(int argc, char *argv[]) 
{
	int n;
    printf("enter: ");
    scanf("%d", &n);
    print_forward(n);
	printf("\n");
    print_backward(n);
	return 0;
}
